var categoryConfig = {
    "Accept": "application/json, text/javascript, */*; q=0.01",
    "Accept-Encoding": "gzip, deflate, sdch",
    "Accept-Language": "zh-CN,zh;q=0.8",
    "Connection": "keep-alive",
    "Host": "www.lativ.com",
    // "Referer": "http://www.lativ.com/WOMEN",
    "User-Agent": "Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/48.0.2564.116 Safari/537.36",
    "X-Requested-With": "XMLHttpRequest"
};

var detailConfig = {
    "Accept": "application/json, text/javascript, */*; q=0.01",
    "Accept-Encoding": "gzip, deflate, sdch",
    "Accept-Language": "zh-CN,zh;q=0.8",
    "Cache-Control": "max-age=0",
    "Connection": "keep-alive",
    "Host": "www.lativ.com",
    // "If-Modified-Since": "Tue, 15 Mar 2016 11:53:29 GMT",
    // "Referer": "http://www.lativ.com/Detail/28853011",
    "User-Agent": "Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/48.0.2564.116 Safari/537.36",
    "X-Requested-With": "XMLHttpRequest"
};


var COLOR = {
    "乳白色": "1627207:28321;",
    "白色": "1627207:28320;",
    "米白色": "1627207:4266701;",

    "浅麻灰": "1627207:28332;",
    "深麻灰": "1627207:3232478;",
    "灰色": "1627207:28334;",
    "银色": "1627207:28330;",

    "黑色": "1627207:28341;",

    "桔红色": "1627207:4950473;",
    "玫红": "1627207:3594022;",
    "粉红": "1627207:3232480;",
    "红色": "1627207:28326;",
    "浅粉红": "1627207:4464174;",
    "西瓜红": "1627207:3743025;",
    "酒红色": "1627207:28327;",

    "卡其": "1627207:28331;",
    "姜黄色": "1627207:15409374;",
    "明黄色": "1627207:20412615;",
    "杏色": "1627207:30155;",
    "柠檬黄": "1627207:132476;",
    "橘色": "1627207:90554;",
    "浅黄色": "1627207:60092;",
    "荧光黄": "1627207:6134424;",
    "金色": "1627207:28328;",
    "香槟色": "1627207:130166;",
    "黄色": "1627207:28324;",

    "墨绿色": "1627207:3232483;",
    "墨绿色": "1627207:80557;",
    "浅绿色": "1627207:30156;",
    "绿色": "1627207:28335;",
    "翠绿色": "1627207:8588036;",
    "荧光绿": "1627207:6535235;",
    "青色": "1627207:3455405;",

    "天蓝色": "1627207:3232484;",
    "亮蓝": "1627207:5138330;",
    "宝蓝": "1627207:3707775;",
    "水蓝": "1627207:28337;",
    "浅蓝": "1627207:28337;",
    "深蓝": "1627207:28340;",
    "湖蓝色": "1627207:5483105;",
    "蓝色": "1627207:28338;",
    "藏青": "1627207:28866;",

    "浅紫色": "1627207:4104877;",
    "深紫色": "1627207:3232479;",
    "紫红色": "1627207:5167321;",
    "紫罗兰": "1627207:80882;",
    "紫色": "1627207:28329;",

    "咖啡色": "1627207:129819;",
    "巧克力色": "1627207:3232481;",
    "栗色": "1627207:6071353;",
    "浅棕色": "1627207:30158;",
    "深卡其布色": "1627207:3232482;",
    "深棕色": "1627207:6588790;",
    "褐色": "1627207:132069;",
    "驼色": "1627207:3224419;",

    "花色": "1627207:130164;",

    "透明": "1627207:107121;"
};

var SIZE = {
    // "145/80A": "20509:649458002;",
    // "150/80A": "20509:66579689;",
    // "155/80A": "20509:3959184;",
    // "155/84A": "20509:-1004;",
    // "160/84A": "20509:6215318;",
    // "160/88A": "20509:-1005;",
    // "165/84A": "20509:-1001;",
    // "165/88A": "20509:3267942;",
    // "165/92A": "20509:-1006;",
    // "170/92A": "20509:3267943;",
    // "170/96A": "20509:-1007;",
    // "175/96A": "20509:3267944;",
    // "175/100A": "20509:71744989;",
    // "180/108B": "20509:-1002;",
    // "185/112C": "20509:-1003;"
};

var SELLER_CIDS = {
    "T恤&POLO-WOMEN":       1251438469,
    "衬衫-WOMEN":           1251438470,
    "针织衫-WOMEN":         1251438471,
    "外套类-WOMEN":         1251438472,
    "裤装&裙装-WOMEN":      1251438473,
    "内衣&内裤&袜子-WOMEN": 1251438474,
    "起居服&配件-WOMEN":    1251438475,

    "T恤&POLO-MEN":       1251439047,
    "衬衫-MEN":           1251439048,
    "外套类-MEN":         1251439049,
    "裤装-MEN":           1251439050,
    "内衣&内裤&袜子-MEN": 1251439051,
    "起居服&配件-MEN":    1251439052,

    "印花T恤-TOGETHER":    1276391404,
    "上衣-TOGETHER":       1276391405,
    "POLO衫-TOGETHER":     1276391406,
    "休闲衬衫-TOGETHER":    1281599842,
    "外套-TOGETHER":       1276391407,
    "裤装-TOGETHER":       1276391408,
    "其他-TOGETHER":       1276391409,
};


exports.categoryConfig = categoryConfig;
exports.detailConfig = detailConfig;
exports.COLOR = COLOR;
exports.SIZE = SIZE;
exports.SELLER_CIDS = SELLER_CIDS;
