
module.exports = function (title, price){ 
  var cid = '';
  var cateProps = '';
  var sizePre = '';
  var inputPids = '';
  var inputValues = '';
  var subtitle = '';

  // POLO-男  50020237
  // T恤-男  50000436
  // 背心-男  50011153
  // 短裤-男  124702002
  // 牛仔裤-男  50010167
  // 休闲裤-男  3035
  // 内裤-男  50008882
  // 运动T恤-男  50013228
  // 运动短裤-男  50023108
  // 运动长裤-男  50023107

  if (~title.indexOf("男")) {
    if (/POLO/i.test(title)) {
      cid = "50010402";
      cateProps += "20000:29534;42722636:20213;122216345:29457;122216507:3226292;122216515:29535;122216586:29947;";
    }
    if (/T恤/i.test(title)) {
      cid = "50000436";
      cateProps += "20000:29534;20551:22252803;20603:29452;20663:29447;42722636:248572013;122216345:29457;122216348:29445;122216507:3226292;122216515:29535;122216586:29947;";
    }
    if (/背心/.test(title)) {
      cid = "50011153";
      cateProps += "20000:29534;42722636:20213;122216515:29535;122216586:29947;122276315:3273241;";
    }
    if (/衬衫/.test(title)) {
      cid = "50011123";
      cateProps += "20000:29534;20663:20213;42722636:20213;122216345:29938;122216348:29444;122216507:3226292;122216515:29535;122216586:29947;";
    }
    if (/牛仔裤/.test(title)) {
      cid = "50010167";
      cateProps += "20000:29534;42722636:248572013;122216515:29535;122276111:20525;";
      //尺寸 20518
      sizePre = "20518";
    }
    if (/短裤|中裤|沙滩裤|五分裤|七分裤|松紧短裤/.test(title)) {
      cid = "50023108";
      cateProps += "20000:29534;122216608:20532;";
      inputPids = "6103476,13021751";
      inputValues = price + ",短裤";
      subtitle = "";
    }
    if (/三角短裤|平角短裤|平脚短裤|棉质短裤|印花短裤/.test(title)) {
      cid = "50008882";
      cateProps += "20000:29534;24477:20532;";
      inputPids = "166332348";
      inputValues = "1条";
      subtitle = "";
    }
    if (/长裤|松紧裤|休闲裤/.test(title)) {
      cid = "3035";
      cateProps += "20000:29534;42722636:248572013;122216515:29535;122216586:29947;122276111:20525;";
      //尺寸 20518
      sizePre = "20518";
    }
    if (/运动T恤/i.test(title)) {
      cid = "50013228";
      cateProps += "20000:29534;20663:29447;122216348:29445;122216608:20532;";
      inputPids = "6103476,13021751";
      inputValues = price + ",other";

      sizePre = "20509";
      // 尺寸 20509
      // propAlias   这里要把自定义属性值改成销售属性别名
      // 20509:29696:其它尺码
    }
    if (/运动短裤/i.test(title)) {
      cid = "50023108";
      cateProps += "20000:29534;122216608:20532;";
      inputPids = "6103476,13021751";
      inputValues = price + ",短裤";
    }
    if (/运动(.*?)长裤|运动(.*?)紧身裤|紧身裤/i.test(title)) {
      cid = "50023107";
      cateProps += "20000:29534;122216608:20532;";
      inputPids = "6103476,13021751";
      inputValues = price + ",长裤";
    }
    if (/羽绒/.test(title)) {
      cid = "50011167";
      cateProps += "20000:29534;6861561:20213;42722636:20213;122216515:29535;122216562:3226292;";
    }
    if (/风衣/.test(title)) {
      cid = "50011159";
      cateProps += "20000:29534;31611:26486055;42722636:20213;122216345:29938;122216515:29535;122216562:3226292;122216586:29947;";
    }
    if (/西服/.test(title)) {
      cid = "50010160";
      cateProps += "20000:29534;31611:3267617;42722636:20213;122216507:3226292;122216515:29535;122216586:29947;122276377:3267910;";
    }
    if (/茄克|外套/.test(title)) {
      cid = "50011739";
      cateProps += "20000:29534;122216608:20532;";
      inputPids = "6103476,13021751";
      inputValues = price + ",茄克/外套";
    }
    if (/羽绒/.test(title)) {
      cid = "50011167";
      cateProps += "20000:29534;6861561:20213;42722636:20213;122216515:29535;122216562:3226292;";
    }
    if (/棉衣/.test(title)) {
      cid = "50011165";
      cateProps += "20000:29534;42722636:20213;122216515:29535;122216562:3226292;122216586:29947;";
    }
  }

  // 衬衫-女  162104
  // T恤-女 50000671
  // 吊带-背心-女 50010394
  // 短裤-女 50023108
  // 短裙-女 1623
  // 连衣裙-女 50010850
  // 牛仔裤-女 162205
  // 文胸-女 50008881
  // 休闲裤-女 162201
  // 雪纺-女 162116
  // 针织-女 50000697
  // 内裤-女 50008882
  // 运动T恤-女 50013228
  // 运动短裤-女 50023108
  // 运动长裤-女 50023107

  if (/女|bra/i.test(title)) {
    if (/T恤|中袖|长衫|七分袖/i.test(title)) {
      cid = "50000671";
      cateProps += "20021:105255;13328588:492838734;";
    }
    if (/POLO/i.test(title)) {
      cid = "50022889";
      cateProps += "20000:109712276;122216608:20533;";
      inputPids = "6103476,13021751";
      inputValues = price + ",POLO衫";
    }
    if (/吊带|背心/.test(title)) {
      cid = "50010394";
      cateProps += "20000:29534;20021:105255;24477:20533;";
    }
    if (/文胸/.test(title)) {
      cid = "50008881";
      cateProps += "20000:29534;5260022:113084;122216483:103092;122216591:3269820;122216608:3269958;122442403:3269842;122508284:607964276;";

      // 尺寸 122508275
      sizePre = "122508275";
    }
    if (/雪纺/.test(title)) {
      cid = "162116";
      cateProps += "122216347:828914351;";
    }
    if (/针织/.test(title)) {
      cid = "50000697";
      cateProps += "20551:105255;13328588:492838732;122216347:828914351;";
    }
    if (/衬衫/.test(title)) {
      cid = "162104";
      cateProps += "20021:105255;13328588:492838731;";
    }
    if (/西装/.test(title)) {
      cid = "50008897";
      cateProps += "122216347:728146012;";
    }
    if (/连衣裙/.test(title)) {
      cid = "50010850";
      cateProps += "122216347:828914351;";
    }

    if (/运动(.*?)短裤|短裤|中裤|七分裤|宽腿裤/.test(title)) {
      cid = "50023108";
      cateProps += "20000:29534;122216608:20533;";
      inputPids = "6103476,13021751";
      inputValues = price + ",短裤";

      // 尺寸 20509
      sizePre = "20509";
    }
    if (/内裤|三角短裤|平脚短裤|生理裤|安全裤|平口裤/.test(title)) {
      cid = "50008882";
      cateProps += "20000:29534;24477:20533;122216608:3267959;";
      inputPids = "166332348";
      inputValues = "1条";
      subtitle = "";
    }
    if (/短裙|牛仔(.*?)裙|紧身裙|窄裙|迷你裙|中裙|裤裙|裙裤|喇叭裙|印花长裙/.test(title)) {
      cid = "1623";
      cateProps += "122216347:828914351;";
    }
    if (/长裤|休闲裤|紧身裤|九分裤|紧身裤|踩脚裤|带裤紧身窄裙|百搭裤|松紧裤/.test(title)) {
      cid = "162201";
      //尺寸 20518
      sizePre = "20518";
    }
    if (/牛仔裤|牛仔(.*?)裤/.test(title)) {
      cid = "162205";
      cateProps += "122216347:828914351;";
      //尺寸 20518
      sizePre = "20518";
    }
    if (/运动(.*?|[^POLO])衫/i.test(title)) {
      cid = "50011717";
      cateProps += "20000:29534;122216608:20533;";
      inputPids = "6103476,13021751";
      inputValues = price + ",运动卫衣/套头衫";
    }
    if (/运动(.*?)T恤|运动(.*?)吊带衫|运动(.*?)背心/.test(title)) {
      cid = "50013228";
      cateProps += "20000:29534;20663:29448;122216348:29445;122216608:20533;";
      inputPids = "6103476,13021751";
      inputValues = price + ",T恤";
    }
    if (/运动(.*?)长裤|运动(.*?)裤/.test(title)) {
      cid = "50023107";
      cateProps += "20000:29534;122216608:20533;";
      inputPids = "6103476,13021751";
      inputValues = price + ",长裤";
    }

    if (/羽绒大衣|羽绒(.*?)外套/.test(title)) {
      cid = "50008899";
      cateProps += "20000:29534;122216347:740138901;";
    }
    if (/茄克|外套|连帽/.test(title)) {
      cid = "50011739";
      cateProps += "20000:29534;122216608:20533;";
      inputPids = "6103476,13021751";
      inputValues = price + ",茄克/外套";
    }
    if (/风衣|连帽外套/.test(title)) {
      cid = "50008901";
      cateProps += "122216347:728146012;";
    }
    if (/大衣/.test(title)) {
      cid = "50013194";
      cateProps += "20021:20213;13328588:492838731;122216347:728146012;";
    }
    if (/羽绒/.test(title)) {
      cid = "50008899";
      cateProps += "20000:29534;122216347:740138901;1627207:28332;20509:6215318;";
    }
    if (/棉衣/.test(title)) {
      cid = "50008900";
      cateProps += "20000:29534;122216347:740138901;";
    }
  }
  if (!cid) {
    cid = "50000671";
    cateProps += "20021:105255;13328588:492838734;";
  }

  return {
    cid: cid,
    cateProps: cateProps,
    sizePre: sizePre,
    inputPids: inputPids,
    inputValues: inputValues,
    subtitle: subtitle
  };
};